apps/api/app/controllers/application_controller.rb

  def authorize
    @headers = request.headers
    if @headers['Authorization'].present?
      token = @headers['Authorization'].split(' ').last
      decoded_token = decode_google_id_token(token)
      render json: { error: 'ID_TOKEN_EXPIRED' }, status: 401 and return if decoded_token[:error].present?
      find_or_create_user_from_decoded_token(decoded_token)
      @user = User.find_or_create_by(email: decoded_token[:email])
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", nil], ["email", "oursceneapp@gmail.com"], ["created_at", "2022-11-15 20:28:54.780203"], ["updated_at", "2022-11-15 20:28:54.780203"]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "oursceneapp@gmail.com"], ["LIMIT", 1]]

  def find_or_create_user_from_decoded_token(decoded_token)
    email = decoded_token[:email]
    @user = User.find_or_create_by(email: email)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Our Scene"], ["email", "oursceneapp@gmail.com"], ["created_at", "2022-11-15 20:44:58.639046"], ["updated_at", "2022-11-15 20:44:58.639046"]]