apps/api/app/controllers/users_controller.rb

  def index
    p 'HERE'
    @users = User.all
---
SELECT "users".* FROM "users"

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]